app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit                                                                                      #Form
		@student = Student.find(params[:id])

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-03-19 06:02:06.096275"], ["updated_at", "2019-03-19 06:02:06.096275"]]
---
	def create                                                                               #Create
    @student = Student.create(student_params)

SELECT "students".* FROM "students"
---
	def index                                                                                   #Read
    @students = Student.all

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@student = Student.find(params[:id])                          #Read

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "faf"], ["last_name", "dafgadfg"], ["updated_at", "2019-03-16 20:14:27.801745"], ["id", 17]]
---
	def update                                                                            #Update
    @student = Student.find(params[:id])
    @student.update(student_params)